# Importing Libraries

In [1]:
# Importing Libaries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import gc

In [2]:
# creating path
path = r"C:\Users\Akira\Documents\Instacart Basket Analysis"

In [3]:
#importing dataframes
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_flags_updated.pkl'))

In [4]:
customer = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

# Customer Dataframe Profile

In [5]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
customer.shape

(206209, 10)

# Data Wrangling

To Do:

change 'Surnam' to 'surname'

Change 'First Name' to 'first_name'

change 'STATE' to 'state'

change 'Gender' to lowercase 'gender'

change 'Age' to lowercase 'age'

change 'fam_status' to 'marital_status'

change 'n_dependants' to 'num_of_dependants'

check for missing values

check for mixed types

check for duplicates

In [9]:
# changing the name of columns 
customer.rename(columns = {'surnam' : 'surname'}, inplace = True)
customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)
customer.rename(columns = {'State': 'state'}, inplace = True)
customer.rename(columns = {'Gender' : 'gender'}, inplace = True)
customer.rename(columns = {'Age' : 'age'}, inplace = True)
customer.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)
customer.rename(columns = {'n_dependants' : 'num_of_dependants'}, inplace = True)

In [10]:
# checking the renamed columns
customer.head()

,user_id,first_name,Surnam,gender,STATE,age,date_joined,num_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Missing Values

In [11]:
# Check for missing values

customer['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [12]:
# missing values here for first name

customer['first_name'].value_counts(dropna = False)

first_name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

In [13]:
customer['Surnam'].value_counts(dropna = False)

Surnam
Hamilton      252
Randall       248
Lamb          243
Pennington    243
Barnett       242
             ...
Poole         172
Bauer         166
Pearson       164
Payne         163
Jordan        162
Name: count, Length: 1000, dtype: int64

In [14]:
customer['STATE'].value_counts(dropna = False)

STATE
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [15]:
customer['age'].value_counts(dropna = False)

age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

In [16]:
customer['date_joined'].value_counts(dropna = False)

date_joined
9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: count, Length: 1187, dtype: int64

In [17]:
customer['num_of_dependants'].value_counts(dropna = False)

num_of_dependants
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [18]:
customer['marital_status'].value_counts(dropna = False)

marital_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [19]:
customer['income'].value_counts(dropna = False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

## Mixed Data types

In [20]:
# looking in customer df to see if there are any mixed type
for col in customer.columns.tolist():
  weird = (customer[[col]].map(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

first_name

the first_name column has mixed types. most likely correlating with the missing values

In [21]:
customer.isnull().sum()

user_id                  0
first_name           11259
Surnam                   0
gender                   0
STATE                    0
age                      0
date_joined              0
num_of_dependants        0
marital_status           0
income                   0
dtype: int64

## Handling the missing values

In [22]:
#finding missing values
customer.loc[customer['first_name'].isna()]

,user_id,first_name,Surnam,gender,STATE,age,date_joined,num_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [23]:
#addressing missing values by replacing with uknown
customer['first_name'].fillna('Unknown', inplace = True)

In [24]:
# Rechecking for missing values
customer.loc[customer['first_name'].isna()]

Empty DataFrame
Columns: [user_id, first_name, Surnam, gender, STATE, age, date_joined, num_of_dependants, marital_status, income]
Index: []

## Duplicates

In [25]:
customer_dups = customer[customer.duplicated()]

In [26]:
customer_dups

Empty DataFrame
Columns: [user_id, first_name, Surnam, gender, STATE, age, date_joined, num_of_dependants, marital_status, income]
Index: []

# Changing dataframe datatypes

In [27]:
customer.dtypes

user_id               int64
first_name           object
Surnam               object
gender               object
STATE                object
age                   int64
date_joined          object
num_of_dependants     int64
marital_status       object
income                int64
dtype: object

In [28]:
customer['user_id'] = customer['user_id'].astype('int8')

In [29]:
customer['age'] = customer['age'].astype('int8')

In [30]:
customer['num_of_dependants'] = customer['num_of_dependants'].astype('int8')

In [31]:
customer['income'] = customer['income'].astype('int8')

In [32]:
customer.dtypes

user_id                int8
first_name           object
Surnam               object
gender               object
STATE                object
age                    int8
date_joined          object
num_of_dependants      int8
marital_status       object
income                 int8
dtype: object

In [33]:
ords_prods_merge.dtypes

order_id                            int64
user_id                             int64
order_number                        int64
orders_day_of_week                  int64
order_hour_of_day                   int64
days_since_prior_order            float64
product_id                          int64
add_to_cart_order                   int64
reordered                           int64
_merge                           category
product_name                       object
aisle_id                            int64
department_id                       int64
prices                            float64
price_range_loc                    object
busiest_day                        object
busiest_days                       object
busiest_period_of_day              object
max_order                           int64
loyalty_flag                       object
average_price                     float64
spending_flag                      object
median_days_since_prior_order     float64
frequency_flag                     object
dtype: object

In [34]:
ords_prods_merge['order_id'] = ords_prods_merge['order_id'].astype('int8')

In [35]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('int8')

In [36]:
ords_prods_merge['order_number'] = ords_prods_merge['order_number'].astype('int8')

In [37]:
ords_prods_merge['orders_day_of_week'] = ords_prods_merge['orders_day_of_week'].astype('int8')

In [38]:
ords_prods_merge['product_id'] = ords_prods_merge['product_id'].astype('int8')

In [39]:
ords_prods_merge['add_to_cart_order'] = ords_prods_merge['add_to_cart_order'].astype('int8')

In [40]:
ords_prods_merge['reordered'] = ords_prods_merge['reordered'].astype('int8')

In [41]:
ords_prods_merge['aisle_id'] = ords_prods_merge['aisle_id'].astype('int8')

In [42]:
ords_prods_merge['department_id'] = ords_prods_merge['department_id'].astype('int8')

In [43]:
ords_prods_merge['max_order'] = ords_prods_merge['max_order'].astype('int8')

In [44]:
ords_prods_merge['days_since_prior_order'] = ords_prods_merge['days_since_prior_order'].astype('float32')

In [45]:
ords_prods_merge['prices'] = ords_prods_merge['prices'].astype('float32')

In [46]:
ords_prods_merge['average_price'] = ords_prods_merge['average_price'].astype('float32')

In [47]:
ords_prods_merge['median_days_since_prior_order'] = ords_prods_merge['median_days_since_prior_order'].astype('float32')

In [48]:
ords_prods_merge['order_hour_of_day'] = ords_prods_merge['order_hour_of_day'].astype('int8')

In [49]:
ords_prods_merge.dtypes

order_id                             int8
user_id                              int8
order_number                         int8
orders_day_of_week                   int8
order_hour_of_day                    int8
days_since_prior_order            float32
product_id                           int8
add_to_cart_order                    int8
reordered                            int8
_merge                           category
product_name                       object
aisle_id                             int8
department_id                        int8
prices                            float32
price_range_loc                    object
busiest_day                        object
busiest_days                       object
busiest_period_of_day              object
max_order                            int8
loyalty_flag                       object
average_price                     float32
spending_flag                      object
median_days_since_prior_order     float32
frequency_flag                     object
dtype: object

# Checking Garbage

In [50]:
gc.collect()

0

# Merge ords_prods_merge with customer dataframe

In [51]:
ords_prods_customer_merge = ords_prods_merge.merge(customer, on = ['user_id'])

MemoryError: Unable to allocate 194. GiB for an array with shape (26102296302,) and data type int64